In [1]:
#Pandas
#they are used to store data frames
import pandas as pd

In [2]:
#read_csv reads the data from a file or internet
iris = pd.read_csv("https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv")
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [3]:
#datatype of iris  => dataframe
print(type(iris))

<class 'pandas.core.frame.DataFrame'>

In [4]:
df = iris.copy()

In [5]:
df.head

<bound method NDFrame.head of      sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]>

In [6]:
df.head(3)   #displays 3 datas from starting

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

In [7]:
df.tail(4)   #displays 3 datas from ending

     sepal.length  sepal.width  petal.length  petal.width    variety
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [8]:
#prints the dimension of the data set excluding the indexes of rows and lables of columns
print(df.shape)

(150, 5)

In [10]:
#dtypes tells us about the data type of each column
print(df.dtypes)

sepal.length    float64
sepal.width     float64
petal.length    float64
petal.width     float64
variety          object
dtype: object

In [11]:
df.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [12]:
#here we can change the column lables/headers
df.columns = ['sl', 'sw', 'pl' , 'pw', 'flower_variety']

In [13]:
df.columns

Index(['sl', 'sw', 'pl', 'pw', 'flower_variety'], dtype='object')

In [14]:
df.head(4)

    sl   sw   pl   pw flower_variety
0  5.1  3.5  1.4  0.2         Setosa
1  4.9  3.0  1.4  0.2         Setosa
2  4.7  3.2  1.3  0.2         Setosa
3  4.6  3.1  1.5  0.2         Setosa

In [15]:
#describe fun tells us the details abt the numerical data from whole data
df.describe()

               sl          sw          pl          pw
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.057333    3.758000    1.199333
std      0.828066    0.435866    1.765298    0.762238
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [16]:
df.sl   #or df["sl"]

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sl, Length: 150, dtype: float64

In [17]:
df.pw

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: pw, Length: 150, dtype: float64

In [18]:
df.isnull()

        sl     sw     pl     pw  flower_variety
0    False  False  False  False           False
1    False  False  False  False           False
2    False  False  False  False           False
3    False  False  False  False           False
4    False  False  False  False           False
..     ...    ...    ...    ...             ...
145  False  False  False  False           False
146  False  False  False  False           False
147  False  False  False  False           False
148  False  False  False  False           False
149  False  False  False  False           False

[150 rows x 5 columns]

In [19]:
df.isnull().sum()

sl                0
sw                0
pl                0
pw                0
flower_variety    0
dtype: int64

In [20]:
#slicing data

df.iloc[1:4, 2:4]

    pl   pw
1  1.4  0.2
2  1.3  0.2
3  1.5  0.2

In [22]:
#sums of each column
df.sum()

sl                                                            876.5
sw                                                            458.6
pl                                                            563.7
pw                                                            179.9
flower_variety    SetosaSetosaSetosaSetosaSetosaSetosaSetosaSeto...
dtype: object

In [ ]:
#manipulating data in a dataframe